### Pandas Data Frame

In [1]:
import pandas as pd

In [2]:
#empty dataframe
empt_df=pd.DataFrame()

In [3]:
empt_df

Empty DataFrame
Columns: []
Index: []

In [4]:
# create data frame by list
list_df=[1,2,3,4,5]
list_df

[1, 2, 3, 4, 5]

In [5]:
df1=pd.DataFrame(list_df)

In [6]:
df1

   0
0  1
1  2
2  3
3  4
4  5

In [7]:
# multipli column
list_of_list=[[1,2,3,4,5],[6,7,8,9,10]]

In [8]:
list_of_list

[[1, 2, 3, 4, 5], [6, 7, 8, 9, 10]]

In [9]:
df2=pd.DataFrame(list_of_list)

In [10]:
df2

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [11]:
# create data frame by dictionary
dic={
    'ID':[1,2,3],
    'Name':['a','b','c']
}

In [12]:
dic

{'ID': [1, 2, 3], 'Name': ['a', 'b', 'c']}

In [13]:
df2=pd.DataFrame(dic)

In [14]:
df2

   ID Name
0   1    a
1   2    b
2   3    c